tap "caskroom/cask"
# tap "caskroom/versions"
# tap "codeclimate/formulae"
tap "dart-lang/dart"
tap "heroku/brew"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/core"
tap "homebrew/services"
tap "jesseduffield/lazydocker"
# CLI tool for working with Architecture Decision Records
brew "adr-tools"
# Tool for generating GNU Standards-compliant Makefiles
brew "automake"
# GNU File, Shell, and Text utilities
brew "coreutils"
# Extendable version manager with support for Ruby, Node.js, Erlang & more
# brew "asdf"
# Bourne-Again SHell, a UNIX command interpreter
brew "bash"
# Programmable completion for Bash 3.2
brew "bash-completion"
# Collection of small bash scripts for heavy terminal users
brew "bash-snippets"
# Control blink(1) indicator light
brew "blink1"
# Cross-platform make
brew "cmake"
# Dependency manager for Cocoa projects
brew "cocoapods"
# Color-highlighted diff(1) output
brew "colordiff"
# Configurable talking characters in ASCII art
# brew "cowsay"
# Reimplementation of ctags(1)
brew "ctags"
# Lightweight DNS forwarder and DHCP server
brew "dnsmasq", restart_service: true
# Cryptography and SSL/TLS Toolkit
brew "openssl@1.1"
# Functional metaprogramming aware language built on Erlang VM
brew "elixir"
# Functional programming language for building browser-based GUIs
# brew "elm"
# Run arbitrary commands when files change
brew "entr"
# Perl lib for reading and writing EXIF metadata
brew "exiftool"
# Play, record, convert, and stream audio and video
brew "ffmpeg"
# Command-line fuzzy finder written in Go
brew "fzf"
# Distributed revision control system
brew "git"
# Small git utilities
brew "git-extras"
# Git extension for versioning large files
brew "git-lfs"
# High-level command-line interface for Git
# brew "git-town"
# GNU implementation of the famous stream editor
brew "gnu-sed"
# GNU Pretty Good Privacy (PGP) package
brew "gnupg"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Version Control Visualization Tool
# brew "gource"
# Graph visualization software from AT&T and Bell Labs
# brew "graphviz"
# Reliable, high performance TCP/HTTP load balancer
brew "haproxy", restart_service: true
# Convert source code to formatted text with syntax highlighting
# brew "highlight"
# Text-based UI library
brew "ncurses"
# Improved top (interactive process viewer)
brew "htop"
# Add GitHub support to git on the command-line
brew "hub"
# C/C++ and Java libraries for Unicode and globalization
brew "icu4c"
# Interpreted, interactive, object-oriented programming language
brew "python"
# USB multiplexor daemon for iPhone and iPod Touch devices
brew "usbmuxd", args: ["HEAD"]
# Library to communicate with iOS devices natively
brew "libimobiledevice", args: ["HEAD"]
# Cross-platform library for communicating with iOS devices
brew "ideviceinstaller"
# Tools and libraries to manipulate images in many formats
brew "imagemagick"
# Install and debug iPhone apps from the command-line
brew "ios-deploy"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Publish-subscribe messaging rethought as a distributed commit log
# brew "kafka"
# Generic command-line non-JVM Apache Kafka producer and consumer
# brew "kafkacat"
# Kubernetes command-line interface
# brew "kubernetes-cli"
# Pager program similar to more
brew "less"
# International domain name library (IDNA2008, Punycode and TR46)
brew "libidn2"
# Just-In-Time Compiler (JIT) for the Lua programming language
brew "luajit"
# Mac App Store command-line interface
brew "mas"
# High performance, distributed memory object caching system
# brew "memcached"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Port scanning utility for large networks
brew "nmap"
# Manage multiple Node.js versions
brew "nvm"
# Object-relational database system
# brew "postgresql@9.6", link: true
# Protocol buffers (Google's data interchange format)
brew "protobuf"
# Your Swiss Army Knife for Protocol Buffers
brew "prototool"
# Install various Ruby versions and implementations
brew "ruby-build"
# Ruby version manager
brew "rbenv"
# Auto-installs gems for Ruby installs
brew "rbenv-default-gems"
# Persistent key-value database, with built-in net interface
# brew "redis"
# Perl-powered file rename script with many helpful built-ins
# brew "rename"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Safe, concurrent, practical language
brew "rust"
# Portable reimplementation of Impulse Tracker
# brew "schismtracker"
# Static analysis and lint tool, for (ba)sh scripts
brew "shellcheck"
# Add a public key to a remote machine's authorized_keys file
brew "ssh-copy-id"
# User interface to the TELNET protocol (built from macOS Sierra sources)
brew "telnet"
# Code-search similar to ack
brew "the_silver_searcher"
# Text interface for Git repositories
brew "tig"
# Terminal multiplexer
brew "tmux"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Google's JavaScript engine
brew "v8"
# Vi 'workalike' with many additional features
# brew "vim"
# Executes a program periodically, showing output fullscreen
brew "watch"
# Watch files and take action when they change
brew "watchman"
# Internet file retriever
brew "wget"
# JavaScript package manager
brew "yarn"
# Code Climate CLI
# brew "codeclimate/formulae/codeclimate"
# The Dart SDK
brew "dart-lang/dart/dart"
# Everything you need to get started with Heroku
brew "heroku/brew/heroku"
# A simple terminal UI for docker, written in Go
brew "jesseduffield/lazydocker/lazydocker"
cask "1password"
cask "alfred"
cask "betterzipql"
cask "bitbar"
cask "docker"
# cask "dropbox"
cask "firefox"
cask "font-hack-nerd-font"
cask "font-hack-nerd-font-mono"
cask "font-inconsolata"
cask "font-inconsolata-dz"
cask "font-inconsolata-dz-for-powerline"
cask "font-inconsolata-nerd-font"
cask "font-inconsolata-nerd-font-mono"
cask "freeter"
# cask "frescobaldi"
cask "gitup"
cask "gitx"
cask "google-chrome"
# cask "google-cloud-sdk"
# cask "google-hangouts"
cask "gpg-suite"
cask "iterm2"
cask "java"
cask "java8"
cask "jet"
# cask "kindle"
# cask "kindlegen"
cask "kitematic"
# cask "krisp"
# cask "lilypond"
# cask "mactex"
# cask "minikube"
cask "postman"
cask "qlcolorcode"
cask "qlimagesize"
cask "qlmarkdown"
cask "qlprettypatch"
cask "qlstephen"
cask "quicklook-csv"
cask "quicklook-json"
cask "recordit"
# cask "skype"
cask "slack"
cask "soulver"
cask "suspicious-package"
cask "texmaker"
cask "transmit"
cask "visual-studio-code"
cask "vlc"
cask "webpquicklook"
mas "GarageBand", id: 682658836
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Shush", id: 496437906
mas "Wunderlist", id: 410628904
mas "Xcode", id: 497799835
