# marlonrichert/zsh-autocomplete

ohmyzsh/ohmyzsh path:plugins/git
ohmyzsh/ohmyzsh path:plugins/fzf
ohmyzsh/ohmyzsh path:plugins/tmuxinator
ohmyzsh/ohmyzsh path:plugins/rake-fast

# ELLIOTTCABLE/rbenv.plugin.zsh
wintermi/zsh-mise
schoonology/userenv-zsh

chriskempson/base16-shell
softmoth/zsh-vim-mode branch:main

Aloxaf/fzf-tab
Freed-Wu/fzf-tab-source

romkatv/powerlevel10k
